# Bria Stalker
## WK14 4/19/2021
### Python-Pandas Dataframe Processing

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [2]:
#drop series...index is asigning rows
df = DataFrame(np.arange(16).reshape(4,4), 
              index=['Ohio','Colorado','Utah','New York'],
              columns=['one','two','three','four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [3]:
df.values #dataframe is just an array

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [4]:
df.drop(['Colorado','Ohio']) #drops temporarily does not change inital datafram

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [5]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [6]:
df.drop(['two', 'four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [7]:
df.drop('two',axis = 'columns') #drop is different than delete

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [8]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [9]:
df.drop('two',inplace=True, axis = 'columns') #inplace actually alters dataframe
df

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [10]:
df

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [11]:
#Selecting entries in dataframe
df = DataFrame(np.arange(16).reshape(4,4), 
              index=['Ohio','Colorado','Utah','New York'],
              columns=['one','two','three','four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
df['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [13]:
df[['one','two']]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [14]:
df[:2] #returns row 0 and 1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [15]:
df[df['three']>5] #ignore rows with data greater than 5

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [16]:
df >5

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False   True   True
Utah       True   True   True   True
New York   True   True   True   True

In [17]:
df [df < 5] = 0 #all enteries less than 5 are set to 0

In [18]:
df

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [19]:
#select enteries with location and iloc
df.loc['Colorado'] #selects data from colorado row

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [20]:
df.loc['Colorado',['two','four']]

two     5
four    7
Name: Colorado, dtype: int32

In [21]:
df

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [22]:
df.iloc[2] #iloc allows you to use the index number...Utah is at index row 2

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [23]:
df.iloc[2, [3,0,1]] #returns data from index row 2 and then returns data based on index in that row

four    11
one      8
two      9
Name: Utah, dtype: int32

In [24]:
df.iloc[[1,2], [3,0,1]] #nor returns same as above but includes row index 1 and 2

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [25]:
#Arithetic and alignment of data
df1 = DataFrame(np.arange(9).reshape(3,3), columns=list('bcd'),
               index = ['Ohio','Texas','Colorado'])
df2 = DataFrame(np.arange(12).reshape(4,3), columns=list('bde'),
               index = ['Utah','Ohio','Texas','Oregon'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [26]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [27]:
df1 + df2 #only includes what exists in both dataframes

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [28]:
df1.add(df2,fill_value = 0) #combines the two df

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [29]:
df1['e'] = df1['b'] + df1['d']

#

In [30]:
df1

          b  c  d   e
Ohio      0  1  2   2
Texas     3  4  5   8
Colorado  6  7  8  14

In [31]:
df1.add(df2,fill_value = 0)

            b    c     d     e
Colorado  6.0  7.0   8.0  14.0
Ohio      3.0  1.0   6.0   7.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0  16.0
Utah      0.0  NaN   1.0   2.0

In [32]:
#Operation between DataFrame and Series
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [33]:
s = df2.iloc[0]

In [34]:
s # s is series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [35]:
df2 - s #each row is subracted by 0 then 1 then 2

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [36]:
#sorting and ranking
df3 = DataFrame(np.arange(8).reshape(2,4), columns=list('dabc'), 
               index = ['three','one'])
df3

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [37]:
df3.sort_index() # one moves up becasue sorting small to big

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [38]:
df3.sort_index(axis=1) #sorts axis one and puts column headers in alphabetical order

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [39]:
df3.sort_index(axis=1,ascending=False) # now descending order

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [40]:
df4 = DataFrame({'b' :[4,7,-3,2],'a':[0,1,0,1]})

In [41]:
df4

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [42]:
df4.sort_values(by='b') #sorts all the values small to big in column b

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [43]:
df4.sort_values(by=['a','b']) #sorts both columns small to big

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [44]:
df4

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [45]:
df4 = DataFrame({'b' :[14,17,-13,12],'a':[10,11,10,11]})

In [46]:
df4.rank() #ranks data by smallest to biggest value

     b    a
0  3.0  1.5
1  4.0  3.5
2  1.0  1.5
3  2.0  3.5

In [52]:
#Summarizing Data
df = DataFrame([[1.4,np.nan], [7.1,-4.5], [np.nan,np.nan], [0.75,-1.3]],
               index =['a','b','c','d'],
               columns = ['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [53]:
df.sum #sum of data in each row

<bound method DataFrame.sum of     one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3>

In [54]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [55]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [56]:
df.mean() #mean of each column

one    3.083333
two   -2.900000
dtype: float64

In [57]:
df.mean(axis = 1)#axis refers to columns

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [58]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [59]:
df.mean(axis=1,skipna=True)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [60]:
df.min()

one    0.75
two   -4.50
dtype: float64

In [61]:
df.min(axis=1)

a    1.4
b   -4.5
c    NaN
d   -1.3
dtype: float64

In [62]:
df.idxmax() #gives max value in each column

one    b
two    d
dtype: object

In [63]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [64]:
df.idxmax(axis=1) #gives what column max is in row by row

a    one
b    one
c    NaN
d    one
dtype: object

In [65]:
df.describe() #gives all basic stats on data

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [66]:
#Missing data
df= DataFrame([[1,2,3,4],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [67]:
#data cleaning...dropping NaN values
clean_df = df.dropna()#this drops all values with NaN present even of they have other values prsent in the row

In [68]:
clean_df

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [69]:
df.dropna(how='all') #only drops rows with all values set to NaN

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN

In [70]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [71]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [72]:
df.dropna(thresh=2) #drop data with less than 2 values present

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN

In [73]:
df.dropna(thresh=3)#drop data with less than 3 values present..thresh is threshold

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [74]:
df.fillna(0) #fill all NaN with 0

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  0.0  5.0  6.0  0.0
2  7.0  0.0  9.0  0.0
3  0.0  0.0  0.0  0.0

In [76]:
df.fillna(1)#fill all NaN with 1

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  1.0  5.0  6.0  1.0
2  7.0  1.0  9.0  1.0
3  1.0  1.0  1.0  1.0

In [77]:
df #all previous task create new df they do not alter the original one

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [79]:
df.fillna(0,inplace=True) #inplace means it will change our actual orginal df

In [80]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  0.0  5.0  6.0  0.0
2  7.0  0.0  9.0  0.0
3  0.0  0.0  0.0  0.0

In [81]:
#Counting values
df = DataFrame({'Q1':[1,3,4,3,4],'Q2':[2,3,1,2,3],'Q3':[1,5,2,4,4]},index = ['a','b','c','d','e'])
df

   Q1  Q2  Q3
a   1   2   1
b   3   3   5
c   4   1   2
d   3   2   4
e   4   3   4

In [84]:
df['Q1'].value_counts()

4    2
3    2
1    1
Name: Q1, dtype: int64

In [85]:
rs = df.apply(pd.value_counts)
rs

    Q1   Q2   Q3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [86]:
rs.fillna(0)

    Q1   Q2   Q3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [87]:
rs.index.name='values'
rs

         Q1   Q2   Q3
values
1       1.0  1.0  1.0
2       NaN  2.0  1.0
3       2.0  2.0  NaN
4       2.0  NaN  2.0
5       NaN  NaN  1.0